ERP/src/Documents/СчетНаОплатуПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПодписки</Name>
			<BasedOn>
				<xr:Item>Document.Подписка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/CommonModules/КлиентыНаСервере/Ext/Module.bsl
Функция НеоплаченыеСчета(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПодписки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПодписки КАК СчетНаОплатуПодписки
		|ГДЕ
		|	СчетНаОплатуПодписки.Контрагент = &Контрагент
		|	И СчетНаОплатуПодписки.Проведен = ИСТИНА
		|	И СчетНаОплатуПодписки.ПометкаУдаления = ЛОЖЬ
		|	И СчетНаОплатуПодписки.КрайнийСрокОплаты > &ТекущаяДата
		|	И СчетНаОплатуПодписки.Оплата = ЗНАЧЕНИЕ(Документ.ОплатаПодписки.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НеоплаченныеСчета = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	НеоплаченныеСчета.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат НеоплаченныеСчета;
	
КонецФункции
